#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

aws_vpc.this[0]: Refreshing state... [id=vpc-068d9ef39571fbcdf]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-084807a6da1c8d17d]
aws_subnet.private[0]: Refreshing state... [id=subnet-064eeb914ebde7664]
aws_default_security_group.this[0]: Refreshing state... [id=sg-091360fc376d3addd]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-049b4f8c7643a4c71]
aws_subnet.public[1]: Refreshing state... [id=subnet-0cf349743a3b4f0da]
aws_subnet.database[0]: Refreshing state... [id=subnet-073498f208944ce63]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d12519b68c08e797]
aws_route_table.public[0]: Refreshing state... [id=rtb-09e2ca666a95e4c85]
aws_subnet.database[1]: Refreshing state... [id=subnet-03d1623ac23332fe9]
aws_route_table.private[0]: Refreshing state... [id=rtb-015c9ace323e012bd]
aws_subnet.public[0]: Refreshing state... [id=subnet-00e80fb7678e7fa7f]
aws_network_acl.private[0]: Refreshing state... [id=acl-0215e5f512fd2bf22]
aws_db_subnet_group.database[0]: Refreshing state... [id=test-dev-db-group]
aws_network_acl.database[0]: Refreshing state... [id=acl-0c6af6e6ef696672a]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02023f413f2572164]
aws_network_acl.public[0]: Refreshing state... [id=acl-0096cb213297a5ff0]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0f72e824dbfcafd48]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0e93e88c51cb8454a]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a0b2e46c64053b54]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0806c75b609fc41c6]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09e2ca666a95e4c851080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0174bb6ebd2e63f54]
aws_network_acl_rule.database_outbound[0]: Refreshing state... [id=nacl-1152399608]
aws_network_acl_rule.database_inbound[0]: Refreshing state... [id=nacl-3908831627]
aws_network_acl_rule.private_outbound[0]: Refreshing state... [id=nacl-3407258796]
aws_network_acl_rule.private_inbound[5]: Refreshing state... [id=nacl-1077245585]
aws_network_acl_rule.private_outbound[9]: Refreshing state... [id=nacl-2598852349]
aws_network_acl_rule.private_outbound[4]: Refreshing state... [id=nacl-99041437]
aws_network_acl_rule.private_outbound[3]: Refreshing state... [id=nacl-1792381899]
aws_network_acl_rule.private_outbound[5]: Refreshing state... [id=nacl-991788212]
aws_network_acl_rule.private_outbound[1]: Refreshing state... [id=nacl-1353967811]
aws_network_acl_rule.private_outbound[8]: Refreshing state... [id=nacl-3984163853]
aws_network_acl_rule.private_outbound[10]: Refreshing state... [id=nacl-21109394]
aws_network_acl_rule.private_outbound[11]: Refreshing state... [id=nacl-1977283357]
aws_network_acl_rule.private_outbound[2]: Refreshing state... [id=nacl-4050706340]
aws_network_acl_rule.private_outbound[6]: Refreshing state... [id=nacl-4067878107]
aws_network_acl_rule.private_outbound[7]: Refreshing state... [id=nacl-1994180706]
aws_network_acl_rule.private_inbound[6]: Refreshing state... [id=nacl-4014520188]
aws_network_acl_rule.private_inbound[7]: Refreshing state... [id=nacl-853438201]
aws_network_acl_rule.private_inbound[0]: Refreshing state... [id=nacl-2468975271]
aws_network_acl_rule.private_inbound[9]: Refreshing state... [id=nacl-1384307634]
aws_network_acl_rule.private_inbound[2]: Refreshing state... [id=nacl-2156665863]
aws_network_acl_rule.private_inbound[8]: Refreshing state... [id=nacl-2400453175]
aws_network_acl_rule.private_inbound[10]: Refreshing state... [id=nacl-804380138]
aws_network_acl_rule.private_inbound[1]: Refreshing state... [id=nacl-1321159458]
aws_network_acl_rule.private_inbound[4]: Refreshing state... [id=nacl-2159345961]
aws_network_acl_rule.private_inbound[3]: Refreshing state... [id=nacl-3413852138]
aws_network_acl_rule.public_outbound[7]: Refreshing state... [id=nacl-1559846973]
aws_network_acl_rule.public_inbound[2]: Refreshing state... [id=nacl-3866989756]
aws_network_acl_rule.public_outbound[2]: Refreshing state... [id=nacl-113487486]
aws_network_acl_rule.public_outbound[8]: Refreshing state... [id=nacl-2965569186]
aws_network_acl_rule.public_outbound[3]: Refreshing state... [id=nacl-2640765457]
aws_network_acl_rule.public_outbound[4]: Refreshing state... [id=nacl-1662437414]
aws_network_acl_rule.public_outbound[0]: Refreshing state... [id=nacl-1017501046]
aws_network_acl_rule.public_outbound[5]: Refreshing state... [id=nacl-3433958766]
aws_network_acl_rule.public_outbound[6]: Refreshing state... [id=nacl-96834817]
aws_network_acl_rule.public_outbound[9]: Refreshing state... [id=nacl-728216269]
aws_network_acl_rule.public_outbound[1]: Refreshing state... [id=nacl-2801834265]
aws_network_acl_rule.public_inbound[7]: Refreshing state... [id=nacl-3374319412]
aws_network_acl_rule.public_inbound[6]: Refreshing state... [id=nacl-347528881]
aws_network_acl_rule.public_inbound[4]: Refreshing state... [id=nacl-3863251346]
aws_network_acl_rule.public_inbound[5]: Refreshing state... [id=nacl-650444330]
aws_network_acl_rule.public_inbound[3]: Refreshing state... [id=nacl-2544804966]
aws_network_acl_rule.public_inbound[0]: Refreshing state... [id=nacl-4124580380]
aws_network_acl_rule.public_inbound[1]: Refreshing state... [id=nacl-676250521]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-015c9ace323e012bd1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_network_acl.database[0] has been changed
  ~ resource "aws_network_acl" "database" {
      ~ egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
        id         = "acl-0c6af6e6ef696672a"
      ~ ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
        tags       = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-db"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-09e2ca666a95e4c85"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0d12519b68c08e797"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-public"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-015c9ace323e012bd"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0a0b2e46c64053b54"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-private"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_default_network_acl.this[0] has been changed
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-049b4f8c7643a4c71"
      ~ subnet_ids             = [
          - "subnet-00e80fb7678e7fa7f",
          - "subnet-03d1623ac23332fe9",
          - "subnet-064eeb914ebde7664",
          - "subnet-073498f208944ce63",
          - "subnet-0cf349743a3b4f0da",
        ]
        tags                   = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }
  # aws_network_acl.private[0] has been changed
  ~ resource "aws_network_acl" "private" {
      ~ egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "1"
              + rule_no         = 820
              + to_port         = 0
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 840
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 830
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 123
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 810
              + to_port         = 123
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 110
              + to_port         = 443
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 53
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 800
              + to_port         = 53
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 100
              + to_port         = 80
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 230
              + to_port         = 22
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 25
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 220
              + to_port         = 25
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 5432
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 200
              + to_port         = 5432
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 8443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 210
              + to_port         = 8443
            },
          + {
              + action          = "allow"
              + cidr_block      = "82.196.6.227/32"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 240
              + to_port         = 22
            },
        ]
        id         = "acl-0215e5f512fd2bf22"
      ~ ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = 8
              + ipv6_cidr_block = ""
              + protocol        = "1"
              + rule_no         = 820
              + to_port         = 0
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 840
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 830
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 110
              + to_port         = 443
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 53
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 800
              + to_port         = 53
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 100
              + to_port         = 80
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 200
              + to_port         = 22
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 25
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 230
              + to_port         = 25
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 5432
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 210
              + to_port         = 5432
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 8443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 220
              + to_port         = 8443
            },
          + {
              + action          = "allow"
              + cidr_block      = "82.196.6.227/32"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 240
              + to_port         = 22
            },
        ]
        tags       = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-private"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_network_acl.public[0] has been changed
  ~ resource "aws_network_acl" "public" {
      ~ egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "1"
              + rule_no         = 820
              + to_port         = 0
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 840
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 830
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 123
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 810
              + to_port         = 123
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 110
              + to_port         = 443
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 53
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 800
              + to_port         = 53
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 587
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 330
              + to_port         = 587
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 100
              + to_port         = 80
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 300
              + to_port         = 22
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 25
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 320
              + to_port         = 25
            },
        ]
        id         = "acl-0096cb213297a5ff0"
      ~ ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = 8
              + ipv6_cidr_block = ""
              + protocol        = "1"
              + rule_no         = 820
              + to_port         = 0
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 840
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 830
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 110
              + to_port         = 443
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 53
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "17"
              + rule_no         = 800
              + to_port         = 53
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 100
              + to_port         = 80
            },
          + {
              + action          = "allow"
              + cidr_block      = "172.17.0.0/16"
              + from_port       = 25
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 310
              + to_port         = 25
            },
          + {
              + action          = "allow"
              + cidr_block      = "82.196.6.227/32"
              + from_port       = 22
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "6"
              + rule_no         = 300
              + to_port         = 22
            },
        ]
        tags       = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-public"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0913249eecdebc5ae"
        id                   = "eipalloc-084807a6da1c8d17d"
      + network_interface    = "eni-0700006bade5ad8ee"
      + private_dns          = "ip-172-17-10-65.ec2.internal"
      + private_ip           = "172.17.10.65"
        tags                 = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-VPC-us-east-1a"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like
to update the Terraform state to match, create and apply a refresh-only plan:
  terraform apply -refresh-only
aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09b90a3f9f2a80f9d]
aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1224344447]
aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3399309446]
aws_security_group_rule.ingress_with_cidr_blocks[4]: Refreshing state... [id=sgrule-2096142929]
aws_security_group_rule.ingress_with_cidr_blocks[2]: Refreshing state... [id=sgrule-2437240033]
aws_security_group_rule.ingress_with_cidr_blocks[3]: Refreshing state... [id=sgrule-358156365]
aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2050955361]
aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-4227598656]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group_rule.ingress_with_cidr_blocks[0] has been changed
  ~ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      ~ from_port              = -1 -> 0
        id                     = "sgrule-4227598656"
      ~ to_port                = -1 -> 0
        # (8 unchanged attributes hidden)
    }
  # aws_security_group.this_name_prefix[0] has been changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress Rule"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-09b90a3f9f2a80f9d"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Ingress Rule"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rule for HTTP access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rule for HTTPS access"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "172.17.11.0/25",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "52.71.119.166/32",
                ]
              + description      = "Ingress Rule"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "82.196.6.227/32",
                ]
              + description      = "ITSyndicate"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "test-dev-external-sg-20230526075037069800000001"
        tags                   = {
            "DevOps"      = "devops@itsyndicate.org"
            "Environment" = "develop"
            "ManagedBy"   = "Terraform - Only IaC Changes"
            "Name"        = "test-dev-external-sg"
            "Project"     = "Lecture"
            "group"       = "ITS"
            "team"        = "ITS"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_security_group_rule.egress_with_cidr_blocks[0] has been changed
  ~ resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      ~ from_port              = -1 -> 0
        id                     = "sgrule-3399309446"
      ~ to_port                = -1 -> 0
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like
to update the Terraform state to match, create and apply a refresh-only plan:
  terraform apply -refresh-only

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-00e80fb7678e7fa7f"
      + tags                                 = {
          + "Name"                 = "test-dev-bastion"
          + "Role"                 = "bastion"
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/ec2-external/main.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "4e333bf3-548f-48b0-b6f4-02fefe816848"
        }
      + tags_all                             = {
          + "Name"                 = "test-dev-bastion"
          + "Role"                 = "bastion"
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/ec2-external/main.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "4e333bf3-548f-48b0-b6f4-02fefe816848"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09b90a3f9f2a80f9d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-bastion-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance["1"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "jbCISTmpRole"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-064eeb914ebde7664"
      + tags                                 = {
          + "Name"                 = "test-dev-app-1"
          + "Role"                 = "app"
          + "git_commit"           = "bf91c6371aafdf240bf11d7f196af4f5fea0fa48"
          + "git_file"             = "modules/ec2-internal/main.tf"
          + "git_last_modified_at" = "2023-05-25 12:22:49"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "ee151e8a-b42c-4f64-84dd-48852abca3ad"
        }
      + tags_all                             = {
          + "Name"                 = "test-dev-app-1"
          + "Role"                 = "app"
          + "git_commit"           = "bf91c6371aafdf240bf11d7f196af4f5fea0fa48"
          + "git_file"             = "modules/ec2-internal/main.tf"
          + "git_last_modified_at" = "2023-05-25 12:22:49"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "ee151e8a-b42c-4f64-84dd-48852abca3ad"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09b90a3f9f2a80f9d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-app-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:448058496623:targetgroup/test-dev-TG/5801f93be1b90197]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb.this has been changed
  ~ resource "aws_lb" "this" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0"
        name                                        = "test-dev-alb"
      + tags                                        = {}
        # (22 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb.this will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0"
        name                                        = "test-dev-alb"
      ~ tags                                        = {
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/alb/alb.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "this"
          + "yor_trace"            = "8d6f19dd-c0bf-48d6-a9fe-fb7438098d4b"
        }
      ~ tags_all                                    = {
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/alb/alb.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "this"
          + "yor_trace"            = "8d6f19dd-c0bf-48d6-a9fe-fb7438098d4b"
        }
        # (21 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.front_https will be created
  + resource "aws_lb_listener" "front_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:448058496623:certificate/03cca9c6-df8a-41ee-af4a-0dfe89705c55"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:448058496623:targetgroup/test-dev-TG/5801f93be1b90197"
          + type             = "forward"
        }
    }

  # aws_lb_target_group.this will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:448058496623:targetgroup/test-dev-TG/5801f93be1b90197"
        name                               = "test-dev-TG"
      ~ tags                               = {
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/alb/alb.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "this"
          + "yor_trace"            = "3cb9b8e0-ab28-41c9-961f-6b22543bc188"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                           = {
          + "git_commit"           = "cd9cf36061b2576cf99007215aa13f575888e2de"
          + "git_file"             = "modules/alb/alb.tf"
          + "git_last_modified_at" = "2023-05-25 09:08:21"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "this"
          + "yor_trace"            = "3cb9b8e0-ab28-41c9-961f-6b22543bc188"
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 052ad3ac2e9ee12416613febf92b9393b74fb6b0

*Pusher: @dmytro-its, Action: `pull_request`, Working Directory: `terragrunt/dev`, Workflow: `Terragrunt CI/CD Pipeline`*